Tekla Open API Reference for Tekla Structures 2025
Arc.Equals Method (ICurve)
 Checks for equality with another curve
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Equals(
	ICurve other
)
Public Function Equals (
	other As ICurve
) As Boolean
Parameters
other
Type: Tekla.Structures.Geometry3d.ICurve
Other curve
Return Value
Type: Boolean
True if the other curve is an arc and is equal to this
Implements
IEquatable<T>.Equals(T)
See Also
Reference
Arc Class
Equals Overload
Tekla.Structures.Geometry3d Namespace